<a href="https://colab.research.google.com/github/202121510/bmt_python/blob/main/21410_10%EC%A3%BC%EC%B0%A8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
row = pd.date_range('20210507', periods=6)
col = list('ABCD')
df = pd.DataFrame(np.random.randn(6,4), index=row, columns=col)

In [12]:
df

                   A         B         C         D  F
2021-05-07 -0.337525 -1.395265 -1.175926  0.012205  1
2021-05-08  0.507165 -2.182610  0.750142  2.027523  2
2021-05-09  0.623487  0.738393 -0.915303  0.080721  3
2021-05-10  0.994649  0.793738 -0.206286 -0.522085  4
2021-05-11  1.070997 -2.210822 -1.359745  2.421773  5
2021-05-12 -1.029048  0.063959  0.633346 -1.459818  6

In [10]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20210507', periods=6))

In [11]:
df['F'] = s1

In [13]:
df

                   A         B         C         D  F
2021-05-07 -0.337525 -1.395265 -1.175926  0.012205  1
2021-05-08  0.507165 -2.182610  0.750142  2.027523  2
2021-05-09  0.623487  0.738393 -0.915303  0.080721  3
2021-05-10  0.994649  0.793738 -0.206286 -0.522085  4
2021-05-11  1.070997 -2.210822 -1.359745  2.421773  5
2021-05-12 -1.029048  0.063959  0.633346 -1.459818  6

In [15]:
df>0

                A      B      C      D     F
2021-05-07  False  False  False   True  True
2021-05-08   True  False   True   True  True
2021-05-09   True   True  False   True  True
2021-05-10   True   True  False  False  True
2021-05-11   True  False  False   True  True
2021-05-12  False   True   True  False  True

In [14]:
df[df>0]

                   A         B         C         D  F
2021-05-07       NaN       NaN       NaN  0.012205  1
2021-05-08  0.507165       NaN  0.750142  2.027523  2
2021-05-09  0.623487  0.738393       NaN  0.080721  3
2021-05-10  0.994649  0.793738       NaN       NaN  4
2021-05-11  1.070997       NaN       NaN  2.421773  5
2021-05-12       NaN  0.063959  0.633346       NaN  6

In [17]:
df2=df

In [38]:
df2=df .copy()

In [39]:
df2[df2>0] = -df

In [18]:
df2

                   A         B         C         D  F
2021-05-07 -0.337525 -1.395265 -1.175926  0.012205  1
2021-05-08  0.507165 -2.182610  0.750142  2.027523  2
2021-05-09  0.623487  0.738393 -0.915303  0.080721  3
2021-05-10  0.994649  0.793738 -0.206286 -0.522085  4
2021-05-11  1.070997 -2.210822 -1.359745  2.421773  5
2021-05-12 -1.029048  0.063959  0.633346 -1.459818  6

In [19]:
df

                   A         B         C         D  F
2021-05-07 -0.337525 -1.395265 -1.175926  0.012205  1
2021-05-08  0.507165 -2.182610  0.750142  2.027523  2
2021-05-09  0.623487  0.738393 -0.915303  0.080721  3
2021-05-10  0.994649  0.793738 -0.206286 -0.522085  4
2021-05-11  1.070997 -2.210822 -1.359745  2.421773  5
2021-05-12 -1.029048  0.063959  0.633346 -1.459818  6

In [22]:
df.mean(0)

A    0.304954
B   -0.698768
C   -0.378962
D    0.426720
F    3.500000
dtype: float64

In [21]:
df.mean(1)

2021-05-07   -0.379302
2021-05-08    0.620444
2021-05-09    0.705459
2021-05-10    1.012003
2021-05-11    0.984440
2021-05-12    0.841688
Freq: D, dtype: float64

In [23]:
print(df.apply(np.cumsum));print() # 데이터에 함수를 적용
# np.cumsum : 배열에서 주어진 축에 따라 누적되는 원소들의 누적 합을 계산하는 함수

print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용

                   A         B         C         D   F
2021-05-07 -0.337525 -1.395265 -1.175926  0.012205   1
2021-05-08  0.169640 -3.577875 -0.425784  2.039728   3
2021-05-09  0.793127 -2.839482 -1.341087  2.120449   6
2021-05-10  1.787776 -2.045744 -1.547373  1.598364  10
2021-05-11  2.858773 -4.256566 -2.907118  4.020137  15
2021-05-12  1.829725 -4.192607 -2.273772  2.560319  21

A    2.100045
B    3.004561
C    2.109888
D    3.881591
F    5.000000
dtype: float64

In [24]:
df.apply(np.cumsum)

                   A         B         C         D   F
2021-05-07 -0.337525 -1.395265 -1.175926  0.012205   1
2021-05-08  0.169640 -3.577875 -0.425784  2.039728   3
2021-05-09  0.793127 -2.839482 -1.341087  2.120449   6
2021-05-10  1.787776 -2.045744 -1.547373  1.598364  10
2021-05-11  2.858773 -4.256566 -2.907118  4.020137  15
2021-05-12  1.829725 -4.192607 -2.273772  2.560319  21

In [25]:
df

                   A         B         C         D  F
2021-05-07 -0.337525 -1.395265 -1.175926  0.012205  1
2021-05-08  0.507165 -2.182610  0.750142  2.027523  2
2021-05-09  0.623487  0.738393 -0.915303  0.080721  3
2021-05-10  0.994649  0.793738 -0.206286 -0.522085  4
2021-05-11  1.070997 -2.210822 -1.359745  2.421773  5
2021-05-12 -1.029048  0.063959  0.633346 -1.459818  6

In [33]:
df.apply(np.cumsum,axis=1)

                   A         B         C         D         F
2021-05-07 -0.337525 -1.732790 -2.908716 -2.896511 -1.896511
2021-05-08  0.507165 -1.675445 -0.925303  1.102220  3.102220
2021-05-09  0.623487  1.361880  0.446577  0.527297  3.527297
2021-05-10  0.994649  1.788387  1.582101  1.060016  5.060016
2021-05-11  1.070997 -1.139826 -2.499571 -0.077798  4.922202
2021-05-12 -1.029048 -0.965089 -0.331743 -1.791561  4.208439

In [27]:
print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용

A    2.100045
B    3.004561
C    2.109888
D    3.881591
F    5.000000
dtype: float64

In [43]:
df.apply(lambda x: x.max() - x.min())

A    0.733472
B    2.146863
C    1.153460
D    2.409568
F    5.000000
dtype: float64

In [ ]:
df

In [28]:
lambda x : x.max() - x.min

In [44]:
s = pd.Series(np.random.randint(0, 7, size = 10))
print(s);print()
print(s.value_counts()) # 유일한 값별 개수 세기

0    4
1    3
2    6
3    0
4    1
5    5
6    2
7    5
8    5
9    0
dtype: int64

5    3
0    2
6    1
4    1
3    1
2    1
1    1
dtype: int64

In [45]:
df

                   A         B         C         D  F
2021-05-07 -0.337525 -1.395265 -1.175926 -0.012205 -1
2021-05-08 -0.507165 -2.182610 -0.750142 -2.027523 -2
2021-05-09 -0.623487 -0.738393 -0.915303 -0.080721 -3
2021-05-10 -0.994649 -0.793738 -0.206286 -0.522085 -4
2021-05-11 -1.070997 -2.210822 -1.359745 -2.421773 -5
2021-05-12 -1.029048 -0.063959 -0.633346 -1.459818 -6

In [51]:
s = pd.Series(np.random.randint(1, 7, size = 6000))
s.value_counts()

3    1012
2    1008
4    1006
1    1002
5     988
6     984
dtype: int64

In [52]:
# Concat (연결)
df = pd.DataFrame(np.random.randn(10, 4)) # 수치 값 / 인덱스 번호 임의(0~) / 컬럼 번호 임의(0~)

pieces = [df[:3], df[3:7], df[7:]] # 조각내기

print(pd.concat(pieces)) # 합치기

          0         1         2         3
0 -2.180761  0.838893 -1.407548 -0.233561
1 -1.201365 -1.096412 -1.321899 -0.331005
2 -0.468685 -0.211145 -0.250909 -0.494049
3 -0.896355 -0.735015 -0.101807 -0.302950
4  0.608437  0.576777  1.108394 -1.096567
5 -1.329569 -1.626450 -0.198999  0.580872
6 -0.203311  2.077121  1.237536  0.063674
7  0.639815  0.813637  1.150552 -1.126748
8 -0.881992  0.217789 -0.926764 -0.697181
9 -0.547807  0.016375 -0.352052 -0.771524

In [53]:
df = pd.DataFrame(np.random.randn(10, 4))

In [54]:
df

          0         1         2         3
0  0.441516  1.259196 -1.007266  0.293932
1  0.714656  0.434635 -0.735645  1.754128
2  1.986436  0.088709  0.064067  0.914761
3  0.423731 -2.101542 -1.220208  0.439542
4  0.995568  0.114378 -1.337874  0.209648
5  0.449151  0.016817  0.273023 -1.043340
6  2.168347  0.419844  0.157062  1.995708
7  1.157191  0.168504 -0.438049  0.459209
8  0.387241 -1.886006 -0.651633 -0.960846
9  0.337488  0.540259 -0.832810 -0.767925

In [56]:
# pieces = [df[:3], df[3:7], df[7:]] # 조각내기
pieces = [df[:3], df[3:7], df[7:]]

In [58]:
pd.concat(pieces)

          0         1         2         3
0  0.441516  1.259196 -1.007266  0.293932
1  0.714656  0.434635 -0.735645  1.754128
2  1.986436  0.088709  0.064067  0.914761
3  0.423731 -2.101542 -1.220208  0.439542
4  0.995568  0.114378 -1.337874  0.209648
5  0.449151  0.016817  0.273023 -1.043340
6  2.168347  0.419844  0.157062  1.995708
7  1.157191  0.168504 -0.438049  0.459209
8  0.387241 -1.886006 -0.651633 -0.960846
9  0.337488  0.540259 -0.832810 -0.767925

In [66]:
left = pd.DataFrame(
    {
        'a':['foo', 'foo'],
      'lval': [1, 2]
     }
)
right = pd.DataFrame({'key':['foo', 'foo'], 'rval': [4, 5]})

In [67]:
left

     a  lval
0  foo     1
1  foo     2

In [68]:
right

   key  rval
0  foo     4
1  foo     5

In [65]:
pd_merge = pd.merge(left, right, on = 'key')

In [69]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    }
)

In [70]:
df

     A      B         C         D
0  foo    one  0.249957  0.304465
1  bar    one  0.504494 -0.840203
2  foo    two -0.745592  1.441565
3  bar  three -1.119969  0.333134
4  foo    two -1.077706  0.875315
5  bar    two  0.364815  0.098921
6  foo    one -0.356299  1.449261
7  bar  three -0.416158 -1.596182

In [71]:
a = df.groupby('A').sum()
a

            C         D
A
bar -0.666817 -2.004330
foo -1.929639  4.070606

In [72]:
x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x,y)
list(zipped)
x2, y2 = zip(*zip(x,y))
print(x2)
print(y2)

(1, 2, 3)
(4, 5, 6)

In [74]:
x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x,y)
list(zipped)
x2, y2 = zip(*zip(x,y))
print(x2)
print(y2)

(1, 2, 3)
(4, 5, 6)

In [75]:
a = df.groupby('A','B').sum()
a

ValueError: ignored

In [77]:
df = pd.DataFrame(
    {
        'A' : ['one', 'one', 'two', 'three'] * 3,
        'B' : ['A', 'B', 'C'] * 4,
        'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar' ] * 2,
        'D' : np.random.randn(12),
        'E' : np.random.randn(12)
    }
)

In [78]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A -0.517732 -1.509591
      B -1.301172 -0.482196
      C -2.009374  0.520836
three A -0.501599       NaN
      B       NaN  1.164336
      C -2.774782       NaN
two   A       NaN -0.561012
      B -0.691781       NaN
      C       NaN  0.319351